html/_site/blog/svn-workflow.html
<!DOCTYPE html> 
<html> 
	<head> 
	<title>Getting started with Subversion</title> 
	<meta name="viewport" content="width=device-width, initial-scale=1"> 
	<link rel="stylesheet" href="http://code.jquery.com/mobile/1.1.0/jquery.mobile-1.1.0.min.css" />
	<link rel="stylesheet" href="http://192.168.1.103:4000/media/css/default.css" />
</head> 
<body> 

<div data-role="page">

   <div data-role="header">
      <h1>Getting started with Subversion</h1>
      <a href="/" data-icon="home" data-iconpos="notext" data-direction="reverse">Home</a>
      <a href="http://about.me/stuart.malcolm/" data-icon="search" data-iconpos="notext">about.me</a>
   </div><!-- /header -->

   <div data-role="content">	
      <p><p>
<a href="http://subversion.apache.org/">Subversion</a> is a wonderful tool for Version Control, but the learning
curve can be steep, so here is what I consider the minimum number of
command that you need to get started with SVN. All 4 of them.
</p>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">Creating a repository</h2>
<div class="outline-text-2" id="text-1">


<p>
First off, create a repository using the svnadmin command:
</p>


<pre class="src src-sh">svnadmin create /path/to/repo
</pre>


</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">First-time file import</h2>
<div class="outline-text-2" id="text-2">


<p>
If you have a directory tree of files that you want to get into the
repository to get started with, use svn import:
</p>


<pre class="src src-sh"><span class="org-builtin">cd</span> /path/to/source
svn import * file:///path/to/repo
</pre>


<p>
You then need to check-out the repository that you have just created
to create a working copy.
</p>


<pre class="src src-sh">mkdir ~/work
<span class="org-builtin">cd</span> ~/work
svn co file:///path/to/repo
</pre>


</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">Add multiple files</h2>
<div class="outline-text-2" id="text-3">


<p>
If you have added several files to your working copy and want to add
them all to the repository, use the following command (from the root
of the working copy directory)
</p>


<pre class="src src-sh">svn add * --force
</pre>


<p>
Note that this will not check the files into the repository, only note
that the new files need added.
</p>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4">Commit files into the repository</h2>
<div class="outline-text-2" id="text-4">


<p>
To commit any changes to the repository, use:
</p>


<pre class="src src-sh">svn ci
</pre>


</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5">Autoprop and keyword substitution</h2>
<div class="outline-text-2" id="text-5">


<p>
If you want to use keyword
expansion then you
will need to edit the ~/.subversion/config file and switch autoprops
on and also edit the svn:keyword options for the files you need.
</p>
<p>
You will also need to set the keyword property using e.g.
</p>


<pre class="src src-sh">svn propset svn:keyword Id filename.py
</pre>


</div>
</div>
</p>		
   </div><!-- /content -->

</div><!-- /page -->

</body>
</html>
